app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.tasks.any? %>
---
SELECT  1 AS one FROM "tasks" WHERE "tasks"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]