app/controllers/static_pages_controller.rb

  def home
    if logged_in?
  	 @task = current_user.tasks.build
     @feed_items = current_user.feed.desc.page(params[:page])
---
SELECT  "tasks".* FROM "tasks" WHERE (user_id = 2) ORDER BY tasks.created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tasks" WHERE (user_id = 2)